BAS BMEKZU Project/src/DataProcessors/ИНАГРО_ОбновлениеИнформационнойБазы/ИНАГРО_ОбновлениеИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИНАГРО_ОбновлениеИнформационнойБазы</name>
</mdclass:DataProcessor>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ПараметрыУчетаЭлеватора/ИНАГРО_ПараметрыУчетаЭлеватора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_ПараметрыУчетаЭлеватора</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВестиМониторингПодозрительныхСобытий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиСкладскойУчетНегодныхОтходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиСправочникАвтомобилей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиСправочникВодителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиСправочникПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетКачестваНегодныхОтходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетПолейТоковПоУслугам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетПоПереработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетПоФорме37Сводная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидВесаДляКонтроляПревышенияВПриказеНадОстатками</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидВесаДляКонтроляПриказа</types>
    </type>
  </resources>
  <resources>
    <name>ВключитьКонтрольНомераПробы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВладелецДляОтходов</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаДня</name>
    <comment>Все машины, пришедшие до этого времени считаются пришедшими вчера</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачалаДняПриОтгрузке</name>
    <comment>Все машины, пришедшие до этого времени считаются пришедшими вчера</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВывозДействителенОдинДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыставлятьУслугиОчисткиСушкиПоФактическимПоказателям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйКонтрольДоговоров</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйПроцентОтклоненияВесаТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияТД</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияТМ</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЗаПереоформлениеПлатитНовыйВладелец</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретитьСозданиеЛабАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗачетныйВесРассчитыватьПоПоказателямДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтерактивноеФормированиеРеестровТТН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСистемуКонтроляКачестваПартийЗерна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейДляРедактирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьМаксимальнуюГрузоподъемностьВесов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьОтрицательноеНетто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьПоследовательностьВводаВеса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольОстатковВЗачетномВесе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольПриказаВБизнесПроцессах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольПриказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЛабораторияРаботаетВСистеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяГрузоподъемностьВесов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеВестиУчетПоВидуХраненияВККУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НегодныеОтходы</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>НеДелатьДвижениеВККУПриОтсутствииЛабАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеПроводитьДокументамиРеестрТТНВывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеРассчитыватьУслугиЛабАнализаПриВывозе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеСписыватьЗачетныйВесГодныхОтходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеСписыватьОтходыСВладельцев</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьВесОбразцов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НомерЛабАнализаВФорме36</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбработкаДляРасчетаУслуг</name>
    <type>
      <types>CatalogRef.УдалитьВнешниеОбработки</types>
    </type>
  </resources>
  <resources>
    <name>ОдинаковаяДатаФормСкладскойИРеестра</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойСпособХранения</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособХранения</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьАвтоматическоеНачислениеУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПобочныйПродукт</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ПрефиксУдаленныхДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтклоненияВывозимогоВесаОтВесаВПриказе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РассчитыватьХранениеПоФизическомуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РучноеУправлениеЗачетнымВесом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписыватьУсушкуПоСкладскомуУчету</name>
    <comment>Списывать по учету</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособКонтроляТары</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыКонтроляТары</types>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияОплатыЗаОчисткуСушку</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку</types>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияОплатыЗаУслугуЛабАнализа</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыНачисленияОплатыЗаАнализ</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаВесаНаОчисткуСушкуДляУслуг</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособРасчетаВесаНаОчисткуСушкуДляУслуг</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаНатуральнойСкидки</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыРасчетаНатуральнойСкидки</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаПредварительногоАктаРасчета</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыРасчетаПредварительногоАктаРасчета</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаУбылиОтОчистки</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыРасчетаУбылиОтОчистки</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПриказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтепеньКонтроляВесаТары</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>СтепеньКонтроляИзмененияВесаНакладной</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>СтепеньКонтроляОткрытияДокументов</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>ТипЦеныНоменклатуры</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВключитьИспользованиеКамеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИспользоватьСистемуФиксингаПриВвозе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПриПревышенииВесаОбосновывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСтатьяЗатратПродукции</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>УровеньКонтроляПревышенияВесаВПриказеНадОстатками</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьВТТНКачествоОтПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьМасличность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьСилосПриФормированииРеестраТТННаВвоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьБухДокументыПереоформленияОтражением</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРеестрыТТНВывозДляОтходов3Кат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_НастройкиФормированияРеестровТТН/ИНАГРО_НастройкиФормированияРеестровТТН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_НастройкиФормированияРеестровТТН</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРеестра</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыРеестровТТН</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыРеестровТТН/ИНАГРО_ВидыРеестровТТН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыРеестровТТН</name>
  <enumValues>
    <name>ИНАГРО_РеестрТТНВвоз</name>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_РеестрТТНВвозЖД</name>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_РеестрТТНВнутр</name>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_РеестрТТНВывоз</name>
  </enumValues>
  <enumValues>
    <name>ИНАГРО_РеестрТТНВывозЖД</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/DataProcessors/ИНАГРО_ОбновлениеИнформационнойБазы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНастройкиФормированияРеестров() Экспорт
	
	ТаблицаНастроек = Новый ТаблицаЗначений;
	ТаблицаНастроек.Колонки.Добавить("Период"		, Новый ОписаниеТипов("Дата"));
	ТаблицаНастроек.Колонки.Добавить("Организация"	, Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаНастроек.Колонки.Добавить("ВидРеестра" 	, Новый ОписаниеТипов("ПеречислениеСсылка.ИНАГРО_ВидыРеестровТТН"));
	ТаблицаНастроек.Колонки.Добавить("ИмяРеквизита"	, Новый ОписаниеТипов("Строка"));
	ТаблицаНастроек.Колонки.Добавить("Использовать"	, Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация,
		|	ИНАГРО_ПараметрыУчетаЭлеватора.Период КАК Период
		|ИЗ
		|	Справочник.Организации КАК Организации,
		|	РегистрСведений.ИНАГРО_ПараметрыУчетаЭлеватора КАК ИНАГРО_ПараметрыУчетаЭлеватора
		|
		|СГРУППИРОВАТЬ ПО
		|	Организации.Ссылка,
		|	ИНАГРО_ПараметрыУчетаЭлеватора.Период";
	
	РезЗапроса = Запрос.Выполнить();
	
	Выборка = РезЗапроса.Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьНатройкиПоРеестру(ТаблицаНастроек, Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВвоз,    Выборка.Организация, Выборка.Период);
		ЗаполнитьНатройкиПоРеестру(ТаблицаНастроек, Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВнутр,   Выборка.Организация, Выборка.Период);
		ЗаполнитьНатройкиПоРеестру(ТаблицаНастроек, Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВывоз,   Выборка.Организация, Выборка.Период);
		ЗаполнитьНатройкиПоРеестру(ТаблицаНастроек, Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВвозЖД,  Выборка.Организация, Выборка.Период);
		ЗаполнитьНатройкиПоРеестру(ТаблицаНастроек, Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВывозЖД, Выборка.Организация, Выборка.Период);		
		
	КонецЦикла;	
	
	НовыеНастройки = РегистрыСведений.ИНАГРО_НастройкиФормированияРеестровТТН.СоздатьНаборЗаписей();
	НовыеНастройки.Загрузить(ТаблицаНастроек);
	НовыеНастройки.Записать();	
	
КонецПроцедуры

Процедура ЗаполнитьНатройкиПоРеестру(ТаблицаНастроек, ВидРеестра, Организация, Период)
	
	ПараметрыУчетаЭлеватора = РегистрыСведений.ИНАГРО_ПараметрыУчетаЭлеватора.ПолучитьПоследнее(Период);
	
	Если ПараметрыУчетаЭлеватора = Неопределено Тогда
		
		ПараметрыУчетаЭлеватора = Новый Структура;
		ПараметрыУчетаЭлеватора.Вставить("ВестиУчетПоФорме37Сводная", Ложь);
		ПараметрыУчетаЭлеватора.Вставить("ВестиУчетПолейТоковПоУслугам", Ложь);
		ПараметрыУчетаЭлеватора.Вставить("УчитыватьСилосПриФормированииРеестраТТННаВвоз", Ложь);
		
	КонецЕсли;
	
	Если ВидРеестра = Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВвоз Тогда
		
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "Поставщик", Истина);
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "ЛабораторныйАнализ", Истина);
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "СтепеньВлажности", Истина);
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "СтепеньЗагрязнения", Истина);
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "СтепеньЗараженности", Истина);
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "НомерПробы", Истина);
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "Силос", ПараметрыУчетаЭлеватора.УчитыватьСилосПриФормированииРеестраТТННаВвоз);
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "МестоХранения", ПараметрыУчетаЭлеватора.ВестиУчетПоФорме37Сводная);
		//ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "ПолеТок", ПараметрыУчетаЭлеватора.ВестиУчетПолейТоковПоУслугам);
		
	ИначеЕсли ВидРеестра = Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВнутр Тогда 
		
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "МестоХранения", ПараметрыУчетаЭлеватора.ВестиУчетПоФорме37Сводная);
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "НовоеМестоХранения", ПараметрыУчетаЭлеватора.ВестиУчетПоФорме37Сводная);
		
	ИначеЕсли ВидРеестра = Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВывоз Тогда
		
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "МестоХранения", ПараметрыУчетаЭлеватора.ВестиУчетПоФорме37Сводная);
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "ЛабораторныйАнализ", Истина);
		
	ИначеЕсли ВидРеестра = Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВвозЖД Тогда
		
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "МестоХранения", ПараметрыУчетаЭлеватора.ВестиУчетПоФорме37Сводная);
		
	ИначеЕсли ВидРеестра = Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВывозЖД Тогда			
		
		ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, "МестоХранения", ПараметрыУчетаЭлеватора.ВестиУчетПоФорме37Сводная);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьНастройкуПоРеестру(ТаблицаНастроек, Организация, Период, ВидРеестра, ИмяРеквизита, Использовать)
	
	Стр = ТаблицаНастроек.Добавить();
	
	Стр.Период 			= ?(ЗначениеЗаполнено(Период),Период,НачалоГода(ТекущаяДата()));
	Стр.Организация		= Организация;
	Стр.ВидРеестра 		= ВидРеестра;
	Стр.ИмяРеквизита 	= ИмяРеквизита;
	Стр.Использовать 	= Использовать;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
